Base-Steady/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
	object			sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            sets;
libs            ("libsampling.so");
writeControl    writeTime;
interpolationScheme cellPoint;
setFormat       raw;

fields          ( U );
sets
(
    turbVel
    {
        type            uniform;
        axis            y;
        start           (0 0.358456 0);
        end             (0 1.858456 0);
	nPoints		100;
    }
	
    turbHeightVel
    {
        type            uniform;
        axis            x;
        start           (-38.86199951171875 1.108456 0);
        end             (20 1.108456 0);
	nPoints		600;
    }

    turbSideHeightVel
    {
        type            uniform;
        axis            x;
        start           (-38.86199951171875 1.108456 1.5);
        end             (20 1.108456 1.5);
	nPoints		600;
    }
	
);

// ************************************************************************* //
